
/* This is localization template resource for er.extensions.ERXLocalizer. 
 * ERXLocalizer provids KVC (Key Value Coding) access to localization resources.
 * 
 * These types of key-value pares are acceptable:
 *  
 *    "this is a test" = "some test";
 *    "unittest.key.path.as.string" = "some test";
 *    "unittest" = {"key" = { "path" = { "as" = {"dict"="some test";};};};};
 *
 * Note that if you only call for "unittest", you'll get a dictionary. So you can localize 
 * more complex objects than strings.
 *
 * As long as your Session extends ERXSession, you can do the followings in 
 * your components.
 *
 * Via Java codes: 
 *   valueForKeyPaty("session.localizer.this is a test");
 *   valueForKeyPath("session.localizer.unittest.key.path.as.string")
 *   valueForKeyPath("session.localizer.unittest.key.path.as.dict")
 * 
 * Via WebObjects Builder:
 *   "session.localizer.this is a test"
 *   "session.localizer.unittest.key.path.as.string"
 *   "session.localizer.unittest.key.path.as.dict"
 *
 * For sessionless Apps, you must use another method to get at the requested 
 * language and then call the localizer via
 *
 * ERXLocalizer l = ERXLocalizer.localizerForLanguages(languagesThisUserCanHandle) or
 * ERXLocalizer l = ERXLocalizer.localizerForLanguage("German")
 */

{
    // Examples: 
    "helloMessage" = "Hello @@nameString@@!";
    "You've got messages" = "You've received @@count@@ @@messageLabel@@.";
}
